export const messageData = [
  {
    id: 1,
    chat_id: 1,
    time: '11:55',
    type: 'text',
    text: 'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.',
    user_id: 1,
  },
  {
    id: 2,
    chat_id: 1,
    time: '11:56',
    type: 'file',
    text: '',
    user_id: 1,
    file: {
      id: 1,
      path: '../../assets/images/photo.png',
      size: 10000,
      upload_date: '2023-09-25T11:55:00.000Z',
      content_type: 'image/jpeg',
    },
  },
  {
    id: 3,
    chat_id: 1,
    time: '12:00',
    type: 'text',
    text: 'Круто!',
    user_id: 2,
    current_user: true,
  },
];
